In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2010_0720/0030502.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 24)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,"U.S. Representative, District 5 Democratic 100...",NaN,NaN,"Lewis 44,379","Totals 44,379",NaN,NaN,100.0%,100.0%,County,...,550.0,550.0,DEKALB,100%,8294.0,8294.0,FULTON,100%,35535.0,35535.0
1,NaN,NaN,"Lewis 44,379","Totals 44,379",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,100.0%,100.0%,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CLAYTON,100%,550,550,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
4,CLAYTON,100%,550,550,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,DEKALB,100%,8294,8294,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,FULTON,100%,35535,35535,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,2]]]

In [9]:
df.head(5)

         0      2
4  CLAYTON    550
5   DEKALB   8294
6   FULTON  35535

In [10]:
df.columns = ['county', 'John Lewis']

In [11]:
df.tail(5)

    county John Lewis
4  CLAYTON        550
5   DEKALB       8294
6   FULTON      35535

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

    county   candidate  votes
0  CLAYTON  John Lewis    550
1   DEKALB  John Lewis   8294
2   FULTON  John Lewis  35535

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
county       3 non-null object
candidate    3 non-null object
votes        3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '5'

In [19]:
df['party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate   party
John Lewis  Democrat    44379
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district     party   candidate  votes
0  CLAYTON  U.S. Representative        5  Democrat  John Lewis    550
1   DEKALB  U.S. Representative        5  Democrat  John Lewis   8294
2   FULTON  U.S. Representative        5  Democrat  John Lewis  35535

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')